#language: ru

Функционал: Выход из профиля Кинопоиска

  Структура сценария:

    Когда Нажата кнопка - Войти
    Когда Выбран пункт - У меня уже есть аккаунт
    Когда Нажата кнопка - Яндекс
    Когда Переход на всплывающее окно авторизации
    Когда Заполняется поле "логин" значением "<логин>"
    Когда Заполняется поле "пароль" значением "<пароль>"
    Когда В окне авторизации нажата кнопка - Войти

    Когда Нажата кнопка Выйти

    Тогда Проверка наличия кнопки Войти после выхода из профиля

    Примеры:

      | логин   | пароль |
      | t3stfirst  | 12345Test |
      | t3stsecond  | 12345Test |
      | t3stthird  | 12345Test |