#language: ru

  Функционал: Поиск фильмов по критериям в Кинопоиске

    Сценарий: №2

      Когда Курсор перемещен на кнопку "Фильмы"
      Когда Выбран пункт "Навигатор по фильмам"
      Когда Выбран жанр "ужасы"
      Когда Выбрана страна "США"
      Когда В интервале от "1998" до "2000" года

      Когда Рейтинг от "7"
      Когда Рейтинг IMDb от "7"
      Когда Рейтинг кинокритиков от "80"

      Когда Рейтинг положительных рецензий до "95"
      Когда Рейтинг положительных рецензий от "90"

      Когда Минимальное количество оценок 2000

      Когда Возраст "12+"
      Когда Бюджет от "50"
      Когда Бюджет до "100"
      Когда Кассовые сборы от "25"